Tekla Open API Reference for Tekla Structures 2025
UnitAttributes Methods
The UnitAttributes type exposes the following members.
Methods
Name | Description
Clone
 Clones the object.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
UnitAttributes Class
Tekla.Structures.Drawing Namespace